document.write("<div>5장 반복문</div>");

// 반복문?
// 특정 명령을 반복적으로 수행할 수 있도록 도와주는 문법
// 기존의 방법으로 코드를 복사 붙여넣기하면되지만, 만약 엄청난 수의 양을 반복해야한다면?
// → 반복문을 통해 이러한 문제를 해결!! 

// 첫 번째 반복문 키워드 : while(조건) { ~ 반복 내용 ~ }
// → 조건이 true인 동안에 {}안 반복 내용 반복 가능!
// → while에서 잘못된 조건은 무한 반복이 일어날 수 있으므로 주의!

// 두 번째 반복문 키워드 : for(초기식; 종료조건식; 연산) { ~ 반복 수행할 명령 ~ } 

// 실습 1 : 현재 수강 중인 과목 배열에 저장
// 실습 2 : HTML태그 <li>로 화면에 출력하기
// → 실습은 반복문을 통해 작성을 요하며, while / for 둘 중 편한 걸 선택!)
// 실습 3 : 마지막 항목에 과목 수도 출력하기!!

// 심화 실습
// 실습 : 현재 수강 중인 과목 & 중간 고사 예상 점수를 객체 형태로 만들기
// 객체의 키를 리스트로 반환하는 함수 : Object.keys(객체)
// 객체의 값을 리스트로 반환하는 함수 : Object.values(객체)