document.write("<div>1장 배열 내장 함수 순회</div>");

// // 데이터
// const test = ['네이버','다음','구글','아마존','금오공대'];


// // 기존의 방법
// for(let a = 0; a < test.length; a++)
// {
//     console.log(test[a]);
// }

// // 배열.forEach(함수)
// test.forEach((ele)=>{console.log(ele)});

// // 배열.map(함수)
// test.map((ele)=>{console.log(ele)});

// // 수업 내용

// // forEach와 map의 차이는 ??
// // : 반환되는 것이 있고 없고의 차이!!

// // ---------------------------------------------------------
// // 실습 1 : 배열을 forEach와 map으로 순환해보기 !
// // 실습 2 : 둘의 차이를 코드 결과로 보여라 !

// // ---------------------------------------------------------
// //  1. 실습 정답