document.write("<div>3장 배열 내장 함수 자르기</div>");

// // 데이터
// const test = ['네이버','다음','구글','아마존','금오공대'];

// // 배열.slice(숫자)
// const result1 = test.slice(2);
// console.log(result1);

// // 배열.slice(숫자1,숫자2)
// const result2 = test.slice(1,3);
// console.log(result2);

// // 수업 내용

// // slice(숫자)는 해당 인덱스 숫자부터 잘라서 배열 반환 
// // : 배열로 반환되어 받기 가능!, 원본 배열은 지장 X

// // slice(숫자1,숫자2)는 인덱스 숫자1 이상 인덱스 숫자2 미만을 잘라서 배열 반환
// // : 배열로 반환되어 받기 가능!, 원본 배열은 지장 X

// // ---------------------------------------------------------
// // 실습 1 : 

// // ---------------------------------------------------------
// //  1. 실습 정답