document.write("<div>7장 배열 내장 함수 Join</div>");

// // 데이터
// const test = ['네이버','다음','구글','아마존','금오공대'];

// // 배열.join(함수)
// const result2 = test.join('!');
// console.log(result2);

// const result3 = test.join('$');
// console.log(result3);

// // 수업 내용

// // 배열.join(문자)는 배열 요소 사이사이 마다 문자를 넣어 문자열로 반환
// // : 반환되는 값을 변수로 받기 가능!, 원본 배열 지장 X

// // ---------------------------------------------------------
// // 실습 1 : 

// // ---------------------------------------------------------
// //  1. 실습 정답

